import { Text } from '@vapor-ui/core';
import type { FC } from 'react';

interface IProps {
  className?: string;
  color?: string;
}

const AiIcon: FC<IProps> = ({ className, color }) => {
  color = color || '#FF7E35';
  return (
    <div
      style={{
        display: 'flex',
        alignItems: 'center',
        gap: '8px',
        fontSize: 'var(--vapor-typography-fontSize-025)',
        lineHeight: 'var(--vapor-typography-lineHeight-025)',
        letterSpacing: 'var(--vapor-typography-letterSpacing-000)',
      }}
    >
      <svg
        width="14"
        height="14"
        viewBox="0 0 14 14"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
        style={{
          flexShrink: 0, // SVG 크기 고정
        }}
      >
        <path
          d="M12.6333 3.00009L12.96 2.29343L13.6667 1.96676C13.9267 1.84676 13.9267 1.48009 13.6667 1.36009L12.96 1.03343L12.6333 0.333428C12.5133 0.0734277 12.1467 0.0734277 12.0267 0.333428L11.7 1.04009L11 1.36676C10.74 1.48676 10.74 1.85343 11 1.97343L11.7067 2.30009L12.0333 3.00009C12.1467 3.26009 12.52 3.26009 12.6333 3.00009Z"
          fill={color}
        />
        <path
          d="M4.96666 3.00009L5.29333 2.29343L6 1.96676C6.26 1.84676 6.26 1.48009 6 1.36009L5.29333 1.04009L4.96666 0.333428C4.85333 0.0734277 4.48 0.0734277 4.36667 0.333428L4.04 1.04009L3.33333 1.36676C3.07333 1.48676 3.07333 1.85343 3.33333 1.97343L4.04 2.30009L4.36667 3.00009C4.48 3.26009 4.85333 3.26009 4.96666 3.00009Z"
          fill={color}
        />
        <path
          d="M12.0333 8.00009L11.7067 8.70676L11 9.03343C10.74 9.15343 10.74 9.52009 11 9.64009L11.7067 9.96676L12.0333 10.6734C12.1533 10.9334 12.52 10.9334 12.64 10.6734L12.9667 9.96676L13.6667 9.63343C13.9267 9.51343 13.9267 9.14676 13.6667 9.02676L12.96 8.70009L12.6333 7.99343C12.52 7.74009 12.1467 7.74009 12.0333 8.00009Z"
          fill={color}
        />
        <path
          fillRule="evenodd"
          clipRule="evenodd"
          d="M7.98 3.19343L0.526665 10.6401C0.266665 10.9001 0.266665 11.3201 0.526665 11.5801L2.41333 13.4668C2.67333 13.7268 3.09333 13.7268 3.35333 13.4668L10.8 6.02009C10.9077 5.91779 10.9719 5.78722 10.993 5.65078C11.0029 5.58688 11.0034 5.52169 10.9945 5.45752C10.9753 5.31938 10.9125 5.18593 10.8067 5.08009L8.92 3.19343C8.81344 3.08687 8.68001 3.02398 8.54173 3.00477C8.48345 2.99667 8.42431 2.99633 8.36596 3.00375C8.22494 3.02167 8.08853 3.0849 7.98 3.19343ZM6.58566 6.28281L7.71294 7.4101L2.88333 12.2397L1.75389 11.1103L6.58566 6.28281ZM8.47333 6.47343L7.53333 5.53343L8.45333 4.61343L9.39333 5.55343L8.47333 6.47343Z"
          fill={color}
        />
      </svg>
      <Text
        className={className}
        style={{
          fontSize: 'var(--vapor-typography-fontSize-025)',
          lineHeight: 'var(--vapor-typography-lineHeight-025)',
          letterSpacing: 'var(--vapor-typography-letterSpacing-000)',
          color: color,
        }}
      >
        AI가 요약한 내용이에요
      </Text>
    </div>
  );
};

export default AiIcon;
